обучающие_материалы-tutorials/testTubeMixer/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

units [cm];

vertices
(
    (-0.5 -5 -0.5)
    ( 0.5 -5 -0.5)
    ( 0.5  5 -0.5)
    (-0.5  5 -0.5)
    (-0.5 -5  0.5)
    ( 0.5 -5  0.5)
    ( 0.5  5  0.5)
    (-0.5  5  0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (5 50 5) simpleGrading (1 1 1)
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
